Repository: obedaRahal/Government-Complaints-App
Catalog: lib/l10n/app_*.arb
Languages: ar

# appName
source: Tawasul
ar: تواصل

# splashNmae
source: Government Complaints App
ar: تطبيق الشكاوى الحكومية

# selected_count
source: {count} selected
ar: تم اختيار {count}

# arrow_back
source: Back
ar: رجوع

source: Confirm entry
ar: تأكيد الادخال

# confirm_of_dispatch
source: Confirm sending
ar: تأكيد الارسال

# common_ok
source: OK
ar: حسناً

# common_cancel
source: Cancel
ar: إلغاء

# closing
source: Close
ar: إغلاق

source: Welcome!
ar: ! مرحبا بك

# app_description
source: An app that helps citizens create, organize, and track complaints efficiently and easily
ar: تطبيق يساعد المواطنين على إنشاء، تنظيم، متابعة الشكاوى بكفاءة وسهولة

# new_account
source: Sign up
ar: حساب جديد

source: Log in
ar: تسجيل الدخول

# brand_part1
source: Ta
ar: تو

# brand_part2
source: wasul
ar: اصل

# email_field
source: Email
ar: البريد الالكتروني

# password_field
source: Password
ar: كلمة المرور

# name_field
source: Name
ar: الاسم

# national_number_field
source: National number
ar: الرقم الوطني

# new_password_field
source: Confirm password
ar: تأكيد كلمة المرور

# email_field_hint
source: enter your email...
ar: ادخل بريدك الالكتروني...

# password_field_hint
source: enter your password...
ar: ادخل كلمة المرور الخاصة بك...

# name_field_hint
source: enter your name in Arabic...
ar: ادخل اسمك باللغة العربية...

# national_number_field_hint
source: enter your national number...
ar: ادخل الرقم الوطني الخاص بك...

# new_password_field_hint
source: enter the password again...
ar: ادخل كلمة المرور مرة أخرى...

# login_description
source: Welcome back. Log in and help build a new Syria.
ar: مرحبا بك مجددا سجل دخولك وقم بالمساعدة في بناء سورية جديدة

# did_you_forget_password
source: Forgot your password?
ar: نسيت كلمة المرور ؟

# didnt_have_account
source: Don’t have an account? Create one
ar: ليس لديك حساب ، قم بانشاء

source: Sign up
ar: انشاء حساب

# signup_description
source: Join us and start your journey with a smoother experience with government institutions
ar: انضم الينا وابدا رحلتك في التعامل المريح مع مؤسسات الدولة

# did_you_have_account
source: Already have an account? Go to
ar: لديك حساب فعلا ، قم بعملية

# signup_verify_email
source: Verify account
ar: تأكيد الحساب

# signup_verify_email_description
source: Dear user, please verify your email by entering the 6-digit code. Note that you will lose your code if you leave this page.
ar: عزيزي المستخدم يرجى منك تأكيد بريدك الالكتروني عن طريق ادخال الرمز المكون من ست ارقام علما انك ستفقد الرمز الخاص بك في حال المغادرة

# signup_verify_email_note
source: This is an extra security step
ar: نحن نقوم باجراء احترازي فقط

# input_otp_code
source: Enter the code
ar: ادخل الرمز

# didnt_get_code
source: Didn’t receive a code?
ar: لم تستلم رمز بعد ؟

# resent_otp_code
source: Resend code
ar: إعادة ارسال الرمز

# forget_password_description
source: Please enter your email address to receive a verification code
ar: يرجى ادخال عنوان بريدك الالكتروني لتتلقى رمز التحقق عليه

# forget_password_verify_email
source: Verify entered email
ar: تأكيد البريد المدخل

# forget_password_verify_email_description
source: Please enter the 6-digit code sent to your email
ar: الرجاء ادخال الرمز المكون من ستة أرقام الى بريدك الخاص

# new_password
source: Create a new password
ar: انشاء كلمة مرور جديدة

# new_password_description
source: Your new password must be different from the previous one
ar: يجب أن تكون كلمة المرور الجديدة مختلفة عن السابقة

source: search in complaints
ar: البحث في سجل الشكاوي...

# add_new_complaint
source: Add a new complaint
ar: اضافة شكوى جديدة

source: Complaint number
ar: رقم الشكوى

source: Complaint description
ar: وصف الشكوى

# complaints_history_home
source: Complaint history
ar: سجل الشكوى

# top_bar_complaints_details
source: Complaint details
ar: تفاصيل الشكوى

# complaint_attachments
source: Attachments
ar: مرفقات الشكوى

source: Complaint info
ar: معلومات الشكوى

# complaint_type
source: Type
ar: النوع

source: Government agency
ar: الجهة الحكومية

# date_of_ceartion
source: Creation date
ar: تاريخ الانشاء

# complaint_location
source: Complaint address
ar: عنوان الشكوى

# complaints_history
source: Complaint stages
ar: مراحل الشكوى

# add_more_attachments
source: Attach additional information
ar: ارفاق معلومات اضافية

source: Delete complaint
ar: حذف الشكوى

source: Notes
ar: ملاحظات

source: Additional description
ar: وصف اضافي

# additional_description_hint
source: enter an additional description of the issue...
ar: ادخل وصفا إضافيا للمشكلة التي تواجهها...

source: Additional attachment
ar: مرفق اضافي

# additional_attachment_hint
source: add an attachment for the complaint...
ar: ادخل مرفقا للشكوى...

# more_info_bottom_sheet
source: Additional information
ar: معلومات اضافية

# notification_bottom_sheet
source: Notifications
ar: الاشعارات

# not_found_notification
source: No notifications at the moment
ar: لا توجد إشعارات حالياً

# top_bar_submit_complaint
source: Submit a complaint
ar: تقديم شكوى

# complaint_name
source: Complaint title
ar: اسم الشكوى

# complaint_name_hint
source: enter a title for your complaint...
ar: ادخل اسم للشكوى الخاصة بك...

# complaint_type_hint
source: select complaint type...
ar: اختار نوع الشكوى...

# government_agency_hint
source: select government agency...
ar: اختر الجهة الحكومية...

source: Problem description
ar: وصف المشكلة

# problem_description_hint
source: describe the issue you are facing...
ar: ادخل وصفا للمشكلة التي تواجهها...

# compliant_location_hint
source: enter the complaint address...
ar: ادخل عنوان الشكوى...

# complaint_attachments_hint
source: Add complaint attachments (optional)...
ar: أدخل مرفقات الشكوى(اختياري)...

source: Settings
ar: الاعدادات

source: Dark mode
ar: الوضع الليلي

source: Light mode
ar: الوضع النهاري

# did_you_want_logout
source: Do you want to log out?
ar: هل تريد تسجيل الخروج؟

source: Log out
ar: تسجيل الخروج

source: Something went wrong
ar: حدث خطأ ما

# not_found_complaints
source: No complaints at the moment
ar: لا توجد شكاوى حالياً

source: Show more
ar: عرض المزيد

# not_found_searching
source: No complaint found with this number
ar: لا يوجد شكوى بهذا الرقم

# unexpected_error
source: An unexpected error occurred
ar: حدث خطأ غير متوقع

# otp_has_sent
source: A verification code has been sent to your email
ar: تم إرسال رمز التحقق إلى بريدك

# please_enter_email
source: Please enter your email
ar: الرجاء إدخال البريد

# password_updated_ok
source: Your new password has been set successfully. You can log in now.
ar: تم تعيين كلمة المرور الجديدة بنجاح، يمكنك تسجيل الدخول الآن

# please_enter_password
source: Please enter your password
ar: الرجاء إدخال كلمة المرور

# password_at_least
source: Password must be at least 6 characters
ar: كلمة المرور يجب أن تكون 6 أحرف على الأقل

# passwords_not_match
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# resent_otp_done
source: A new code has been sent to your email
ar: تم إرسال رمز جديد إلى بريدك

# verify_success
source: Code verified successfully
ar: تم تأكيد الرمز بنجاح

# login_success
source: Logged in successfully. Welcome back!
ar: تم تسجيل الدخول بنجاح، أهلاً بك مجدداً

# success
source: Operation completed successfully
ar: تمت العملية بنجاح

# please_enter_name
source: Please enter your name
ar: الرجاء إدخال الاسم

# please_enter_national_number
source: Please enter your national number
ar: الرجاء إدخال الرقم الوطني

# national_number_atleast
source: National number must be 11 digits
ar: الرقم الوطني يجب أن يكون 11 رقم

# delete_complaint_done
source: Complaint deleted successfully
ar: تم حذف هذه الشكوى بنجاح

# not_found_history
source: No history yet for this complaint.
ar: لا يوجد سجل بعد لهذه الشكوى.

# info_sent_success
source: Additional information sent successfully
ar: تم إرسال المعلومات الإضافية بنجاح

# logout_error
source: An error occurred while logging out
ar: حدث خطأ أثناء تسجيل الخروج

# complaint_sent
source: Complaint submitted successfully
ar: تم إرسال الشكوى بنجاح

# download_agency
source: Loading agencies...
ar: جارٍ تحميل الجهات...

# download_types
source: Loading complaint types...
ar: جارٍ تحميل أنواع الشكاوى...

# otp_invalid_6_digits
source: Enter the 6-digit code
ar: أدخل الرمز المؤلف من 6 أرقام

# photos_selected
source: Selected photos
ar: الصور المختارة
